#+HTML_HEAD: <script src="https://cdn.jsdelivr.net/npm/ansi_up@5.1.0/ansi_up.min.js"></script>

#+HTML_HEAD: <script>
#+HTML_HEAD: document.addEventListener("DOMContentLoaded", function () {
#+HTML_HEAD:   const ansi_up = new AnsiUp();
#+HTML_HEAD:   const ansi_re = /\x1b\[[0-9;]*m/;
#+HTML_HEAD:
#+HTML_HEAD:   document.querySelectorAll("pre").forEach(pre => {
#+HTML_HEAD:     if (ansi_re.test(pre.textContent)) {
#+HTML_HEAD:       pre.innerHTML = ansi_up.ansi_to_html(pre.textContent);
#+HTML_HEAD:     }
#+HTML_HEAD:   });
#+HTML_HEAD: });
#+HTML_HEAD: </script>

#+OPTIONS: toc:nil num: nil
#+TITLE: Raft

* Structure

The function space is partitioned by arity into two groups:
 1. *unary*: takes one input
 2. *n-ary*: takes more than one input

Each function may have state associated with it, which is encapsulated
in the class for simplicity and to code in a Object-Oriented manner
since this is a Python implementation.

All data, which flows through the pub/sub graph, and state lives in
separate files from our functions. This significantly decreases lines
of code and allows for a more scalable design.

#+begin_export md
<span style="color:red">this is red</span>
#+end_export

#+begin_src bash :exports results :results output ansi :wrap example
source ~/.bashrc
ctree . 
#+end_src

#+RESULTS:
#+begin_example
[1;34m.[0m
├── [1;34mcommunication/[0m [0;31m# handle transfer or data[0m
├── [1;34mdata/[0m
│   ├── append_entries_req.py
│   ├── append_entries_resp.py
│   ├── vote_req.py
│   └── vote_resp.py
├── [1;34mfunctions/[0m
│   ├── [1;34mn-ary/[0m [0;31m# i.e. if forall X, then do Y[0m
│   │   ├── _candidate.py
│   │   ├── _follower.py
│   │   ├── _leader.py
│   │   └── server.py
│   └── [1;34munary/[0m [0;31m# for handling messages[0m
│       ├── append_entries_req.py
│       ├── append_entries_req_resp.py
│       ├── append_entries_resp_recv.py
│       ├── client_cmd_req.py
│       ├── client_cmd_req_recv.py
│       ├── client_cmd_resp.py
│       ├── client_cmd_resp_recv.py
│       ├── recv.py
│       ├── req_resp.py
│       ├── send.py
│       ├── vote_req.py
│       ├── vote_req_resp.py
│       └── vote_resp_recv.py
└── [1;34mstate/[0m [0;31m# server state[0m
    ├── persistent.py
    └── volatile.py
#+end_example

